app/controllers/reviews_controller.rb

  def create
    @review = Review.new(params[:review])

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("cost", "country", "created_at", "image_type", "rating", "release", "score", "status", "synopsis", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @review = Review.find(params[:id])

    respond_to do |format|
      if @review.update_attributes(params[:review])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "reviews" SET "synopsis" = 'Trading Places is a 1983 American comedy satire film directed by John Landis and written by Timothy Harris and Herschel Weingrod. The film tells the story of an upper class commodities broker (Dan Aykroyd) and a homeless street hustler (Eddie Murphy) whose lives cross paths when they are unknowingly made part of an elaborate test of nature vs nurture by wealthy Duke brothers, Randolph (Ralph Bellamy) and Mortimer (Don Ameche). The film also stars Denholm Elliott and Jamie Lee Curtis. The storyline is often called a modern take on Mark Twain''s classic 19th century novel The Prince and the Pauper.